# 2) ახსენით რა არის კონკატენაცია (concatenation)

# კონკატენაცია - პითონში ნიშნავს ორ ან მეტ სტრინგის  ერთმანეთან დაკავშირებას ისე რო მიიღოთ ერთი მთლიანი სტრინგი.
# ეს მხოლოდ მუშაობს სტრინგებზე. მაგალითად: 

str1 = "გამარჯობა"
str2 = "მეგობარო"
result = str1 + "" + str2
print(result)


# 3) ახსენით რატომ არ შეგვიძლია გავაკეთოთ მათემატიკური ოპერაცია ისეთ რიცხვებზე რომლებიც არის ჩასმული ბრჭყალებში

#იმოიტომ არ შეგვიზლია რომ პითონი სტრინგებში ჩასმულ ციფრებს აღიქვამს როგორც ტექსტს და თუ ჩვენ არ გადავაქციეთ ინნტეჯერად ვერ გავიგებთ ნებისმიერი ციფრიების ჯამს.




# 4) კომენტარის სახით დაწერეთ პასუხი: როგორ უნდა შევამოწმო რა ტიპის არის ჩემი ცვლადი

#python - ში ცვლადის ტიპის შესამოწმებლად ვიყენებთ Type() - ს




#5) რა არის explicit და implicit conversion'ები

#python - ში explicit conversion - არის გამოცხადებული კონვერტაცია ხოლო, implicit conversion - არის არა გამოცხადებული კონვერტაცია.
# ეს ორი კი არის  მონაცემთა ტიპების ერთმანეთში გადაყვანის მეთოდები.



# 6) ჩამოწერეთ რა შედარების ოპერატორი იცით მათემატიკაში

# ჩვენ ვისწავლეთ True and False და == ტოლობა რომელიც ამოწმებს არის თუა არა ორივე მნიშვნელობა ტოლი.
# მეორე არის != ანუ არა ტოლობა  ამოწმებს ანუ არის თუ არა ორივე მნიშვნელობა სხვადასხვა. > -მეტი ამოწმებს არის თუ არა პირველი მნიშვნელობა მეორეზე მეტი.
#ხოლო < - ნაკლებობა ამოწმებს არის თუ არა მნისშვნელობა მეორეზე ნაკლები. >= - მეტია ან ტოლი ამოწმებს  არის თუ არა პირველი მნიშვნელობა მეორეზე მეტი ან ტოლი.
# <= - ნაკლებია ან ტოლი ამოწმებს არის თუ არა  პირველი მნიშვნელობა მეორეზე ნაკლები ან ტოლი.