# 1) გაიხსენეთ და ახსენით წესები რომლებიც მუშაობს ყველა ლოგიკურ ოპერატორზე რაც დღეს ვისწავლეთ (and, or, not)

# and ოპერატორი ჭეშმარიტია მხოლოდ მაშინ, როცა მისი ორივე მხარე  ჭეშმარიტია მაგ:
# A და B ორივე სიმართლეა მაშინ შედეგი  სიმართლეა. მაგრამ თუ ერთი ან ორივე მცდარია მაშინ შედეგი მცდარია.


#or ოპერატორი გამოიყენება ორი ან მეტი პირობის გასაანალიზებლად და ჭეშმარიტია მაშინ როცა მინიმუმ ერთი პირობა ჭეშმარიტია.
#მაგალითად: თუ ორივე პირობა ჭეშმარიტია შედეგი ჭეშმარიტია.თუ ორივე პირობა ჭეშმარიტია შედეგი მაინც ჭეშმარიტია.მაგრამ თუ ყველა პირობა მცდარია შედეგი მცდარია.abs


# მგალითად მოვიყვან ერთ კოდს:print(True or False) # ამის შედეგი იქნება: True
#თუ კიდევ ორივე შეცდომაა print(False or False)#შედეგი იქნება False


# Not- ოპერატორი უსარყოფის ფუნქციას ასრულებს.abs
# მაგალითად: თუ A ჭეშმარიტია,Not A იქნება მცდარი, მაგრამ თუ A მცდარია, Not A იქნება ჭეშმარიტი.