# 3) ახსენით განხსვავება pop'სა და remove'ს შორის


# pop():

# ინდექსის მითითება:
#  .pop() მეთოდი ერგება
#   ინდექსს და ამოიღებს კონკრეტულ ელემენტს სიის იმ ადგილიდან.
# თუ ინდექსი არ არის მითითებული,
#  იგი ამოიღებს ბოლო ელემენტს სიიდან.
# ამოიღებს ელემენტს და დააბრუნებს მას:
#  .pop() უკან აბრუნებს ამოღებულ ელემენტს,
#   ამიტომ მისი გამოყენება შეიძლება ცვლადში შენახვისთვის.



# remove():

# მნიშვნელობის მითითება:
#  .remove() მეთოდი არ იყენებს ინდექსს, არამედ ამოიღებს
#   პირველი წვდომის ელემენტს სიის იმ ადგილიდან, რომელიც მიეცა.
# თუ სიის ელემენტი არ არსებობს, ის გამოიწვევს შეცდომას (ValueError).
# მხოლოდ პირველი გამოჩენა მოიხსნება: თუ სია შეიცავს იგივე მნიშვნელობას
#  რამდენიმე ადგილას, მხოლოდ პირველი მოვნიჭებული მნიშვნელობა ამოიღება.
# მაგალითი: