# 1) განიხილეთ ყველა შედარების ოპერატორი რომელიც დღეს ვისწავლეთ,
#  ახსენით როგორ მუშაობს და თითოეულზე რა შემთხვევაში გამოაქვს True და რა შემთხვევაში გამოაქვს False


#ვისწავლეთ ჩვენ <, >, == , !=, >= ,<=

#1)
# print(12 > 5) # თუ რიცხვი მეტია მაგალითად 10 მეტია 5 ზე
#  გამოიტანს თრუს რადგან ნამდვილად მეტია 10 - თი ხუთზე და თუ ნაკლებია ინებოდა ნებისმიერ რიცხვზე გამოიტანდა  false.
# ამ კოდში 12 იყო მეტი 5თზე და ამიტომ გამოიტანა True.



# print( 12 < 23) #აქ გამოიტანა True რადგან 12 ნაკლებია 23 სამზე და გამოიტანას True.

# print(234 == 234) # აქ გამოიტანა True რადგან 234  არის ტოლი 234 - ტისა და ყოველთვის მასე იქნება რიცხვები თუ ერთმანეთის ტოლია

# print(23 != 5) # ხოლო 23 რათქმაუნდა არ უდრის 5 -თს და ეს გამოიტანს 5 -თს

# print(56 >= 2) #აქ გამოიტანს True - რადგან 56 მართლაც მეტია 2 ზე და ტოლი არ არის

# print( 800 <=  900) # აქ გამოიტანს True - ს  რადგან 800 ნაკლებია 900 სზე

#ხოლო true გამოაქვს იმ სემთხვეწვაში თუ მაგ: 12 > 3. ხოლო false გამოიტანს იმ შემთხვევაში თუ  45 < 7.