# 2) ჩამოწერეთ რომელი data type'ბი იცით და ახსენით რა რას ემსახურება

# data type - არის int,float,string,boolean ხოლო ეხლა კი ჩამმოვწერ რა რას ემსახურება

#1)integer - ეს გამოიყენება რიცხვების  ოპერაციებისთვის.

#2)Float - ეს გამოიყენება ათწილადებისთვის და წერტილოვანი რიცხვებისთვის და მათემატიკური გამოთველბისთვის.

#3) string - ეს არის სიმბოლოების რიგი რომელიც გამოიყენება  ტექსტური მონაცემების შესანახად როგორიცაა მაგალითად "123","hello"

#4) Boolean - აქვს ორი მნიშვნელობა True and False და გამოიყენება ლოგიკური ოპერაციებისთვის.


#3) თქვენი სიტყვებით ახსენით რაში გვჭირდება მონაცემთა ტიპის შეცვლა, მაგალითად string'ის integer'ად გადაქცევა



#სტრინგის ინტენჯერად გადაქცევა, გვჭირდება იმიტომ რომ სტრინგით მაგალითად რიცხვების ჯამს, ვერ გამოიტან ხოლო ინტეჯერად რომ 
#  გადააქცევ ანუ მთელ რიცხავდ მაშინ შესაძლებელი, იქნება ინტეჯერის გაყოფაც გამრავლებას მიმატებაც და გამოკლებაც.



#4) მომხმარებელს შემოატანინეთ რაიმე მონაცემი, შეამოწმეთ როგორი ტიპისაა და ახსენით რატომაა ასე

# number =int(input("enter number: "))


#ანუ მომხმარებელი ამის მეშვეობით, შემოიტანს მთელ რიცხვს იმიტომ არის ასე, რომ მიწერია ცვლადი number, და
#  მინიჭებული აქვს მნიშვნელობად integer რ რაც იმას ნიშნავს რომ შემოიტანს მთელ რიცხვს.



# 5) გატესტეთ ეს კოდი პითონში:

# print(10 < 1)


#10 < 1 არის ლოგიკური გამოტქმა რომელიც ამოწმებს თუ არა  10 ნაკლებია 1 - ზე რადგან ეს არასწორია(10 ნამდვილად არ არის ნაკლები 1ზე)
#  python -აბრუნებს false - რაც მიუთითებს რომ პირობა არ შესრულდა, ლოგიკური ოპერატორები <  აბრუნებენ მხოლოდ ორ შესაძლო
#  მნიშვნელობას True and False - True ასრულებს თუ პირობა შესრულდა false - ასრულებს თუ პირობა არ შესრულდა


