#  მაღაზიაში არის ფასდაკლება მხოლოდ არასრულწოვნებზე და 18 წლის ხალხზე.
#  არასრუწლოვანი ადამიანი მიიღებს 50%იან ფასდაკლებას, 18 წლის ადამიანი მიიღებს 25% ფასდაკლებას,
#   ხოლო სრულწლოვანი გადაიხდის ჩვეულებრივ ფასს.
#   დაწერე პროგრამა რომელიც ადამიანს ეტყვის მან მიიღო თუ არა ფასდაკლება და თუ მიიღო რამდენი.


age = int(input("შეიყვანეთ თქვენი ასაკი: "))


if age < 18:
    print("თქვენ ხართ არასრულწლოვანი და მიიღებთ 50%-იან ფასდაკლებას!")
elif age == 18:
    print("თქვენ ხართ 18 წლის და მიიღებთ 25%-იან ფასდაკლებას!")
else:
    print("თქვენ ხართ სრულწლოვანი და გადაიხდით ჩვეულებრივ ფასს.")
