# 1) შექმენით ცვლადი, სახელად points, რომელიც თავიდან უდრის 50, შემდეგ დაა-update-ეთ ამ ცვლადის მნიშვნელობა, რამოდენიმეჯერ.
#  საბოლოოდ კი დაპრინტეთ ეს ცვლადი


points = 50

points = 60

points = 88

print(points)






# 2) გაასწორეთ შემდეგი კოდი:   
age1 = 156
print(age1)



# 3) დაწერეთ პროგრამა, რომელიც შეიცავს ორ integer ტიპის ცვლადს (მაგალითად, a და b),
#  შემდეგ გამოიანგარიშეთ ამ ცვლადების ჯამი, სხვაობა, ნამრავლი და განაყოფი. 

a = 12

b = 3

num = a + b

print(num)


a = 100

b = 50

sum = a / b

print(sum)


a = 12

b = 11

sum = a - b

print(sum)


a = 5

b = 8

sum = a * b

print(sum)



# 4) დაწერეთ კოდი შეცდომებით და ქვემოთ მიუწერეთ მისი სწორი ვერსია.

# 1b = 23

# 2b = 12

# sum = 1b + 2b

# print(sum) # ამის სწორი ვერსია არის :

b1 =23

b2 = 12

sum = 23 + 12

print(sum)




# 5) ახსენით ოთხივე დავალება კომენტარებით 

#1) პირველივე დავალებაში მე უნდა შემომეტანა ცვლადი რომელიც თვიდან უდრიდა
# 50 ათს და შემდეგ დამეაბდეითებინდა და უდრიდა სხვას და მეც გვაკაეთე შემოვიტანე სამი
#  ცვლადი და მივანიჭე მნიშვნელობა ცვლადს და გამოვატანინე ტერმინალში პასუხი რამოდენიმეჯერ.


#2)მეორეში კი უნდა გაგვესწორებინა კოდი და გავასწორე,
#  ანუ შექმნილი იყო ცვლადი, რომელიც არასწორედ იყო დაწერილი და მე უნდა გამესწორებინა.
#შექმნილი ცვლადს ჰქონდა არასწორედ მიწერილი გვერდით ციფრი მე კიდე ეგ ციფრი დავუწერე ასე age1 = 156 რაც სწორია
#შემდეგ კი გამოვატანინე ტერმინალში პრინტის მეშვეობით print(age1) ესე 



#3)მესამეში უნდა შეგვექმნა ცვლადებოი და მიგვენიჭა ციფრები მერე კი
#  მაგათი ჯამი  განაყოფი  ნამრავლი და სხვაობა გამომეტანა ტემინალში.
#ანუ ასე გამკეთებინა:

a = 12

b = 11

sum = a - b

print(sum)


#4) აქ უნდა დაგვეწერა შეცდომით კოდი და მერე გაგვესწორებინა მე კიდე დავწერე ეს კოდი და გავასწორე

# 1b = 23

# 2b = 12

# sum = 1b + 2b

# print(sum) 
# ამის სწორი ვერსია არის :
b1 =23

b2 = 12

sum = 23 + 12

print(sum)